http-benchmarks/output/run-httpserv_effects-50000-5000.txt
Running 1m test @ http://localhost:8080
  24 threads and 5000 connections
  Thread calibration: mean lat.: 1.489ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 9223372036854776.000ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.459ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 9223372036854776.000ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 9223372036854776.000ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 9223372036854776.000ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.462ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 9223372036854776.000ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 9223372036854776.000ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 9223372036854776.000ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.453ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 9223372036854776.000ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 9223372036854776.000ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 9223372036854776.000ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.498ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.413ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.545ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 9223372036854776.000ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 9223372036854776.000ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.454ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 9223372036854776.000ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 9223372036854776.000ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 9223372036854776.000ms, rate sampling interval: 10ms
[...]
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.09ms    0.86ms  14.82ms   92.51%
    Req/Sec   440.14    648.79     3.78k    72.25%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.00ms
 75.000%    1.35ms
 90.000%    1.67ms
 99.000%    4.55ms
 99.900%   10.58ms
 99.990%   13.16ms
 99.999%   14.61ms
100.000%   14.82ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.053     0.000000            2         1.00
       0.395     0.100000        50084         1.11
       0.570     0.200000       100020         1.25
       0.722     0.300000       150186         1.43
       0.862     0.400000       200034         1.67
       0.998     0.500000       250057         2.00
       1.065     0.550000       274760         2.22
       1.134     0.600000       299939         2.50
       1.203     0.650000       324838         2.86
       1.274     0.700000       349808         3.33
       1.350     0.750000       374737         4.00
       1.392     0.775000       387286         4.44
       1.436     0.800000       399817         5.00
       1.484     0.825000       412239         5.71
       1.538     0.850000       424751         6.67
       1.600     0.875000       437128         8.00
       1.636     0.887500       443430         8.89
       1.675     0.900000       449698        10.00
       1.719     0.912500       455881        11.43
       1.769     0.925000       462073        13.33
       1.829     0.937500       468304        16.00
       1.866     0.943750       471415        17.78
       1.909     0.950000       474577        20.00
       1.958     0.956250       477686        22.86
       2.020     0.962500       480784        26.67
       2.103     0.968750       483915        32.00
       2.161     0.971875       485511        35.56
       2.233     0.975000       487024        40.00
       2.333     0.978125       488591        45.71
       2.491     0.981250       490160        53.33
       2.813     0.984375       491708        64.00
       3.163     0.985938       492489        71.11
       3.641     0.987500       493268        80.00
       4.179     0.989062       494049        91.43
       4.839     0.990625       494832       106.67
       5.563     0.992188       495608       128.00
       6.003     0.992969       496003       142.22
       6.495     0.993750       496391       160.00
       7.055     0.994531       496780       182.86
       7.611     0.995313       497172       213.33
       8.187     0.996094       497559       256.00
       8.471     0.996484       497756       284.44
       8.719     0.996875       497950       320.00
       8.999     0.997266       498147       365.71
       9.279     0.997656       498346       426.67
       9.655     0.998047       498541       512.00
       9.815     0.998242       498632       568.89
       9.999     0.998437       498734       640.00
      10.215     0.998633       498828       731.43
      10.399     0.998828       498925       853.33
      10.615     0.999023       499024      1024.00
      10.767     0.999121       499076      1137.78
      10.895     0.999219       499120      1280.00
      11.015     0.999316       499169      1462.86
      11.239     0.999414       499219      1706.67
      11.463     0.999512       499268      2048.00
      11.575     0.999561       499292      2275.56
      11.703     0.999609       499316      2560.00
      11.815     0.999658       499340      2925.71
      11.983     0.999707       499364      3413.33
      12.375     0.999756       499390      4096.00
      12.463     0.999780       499401      4551.11
      12.559     0.999805       499413      5120.00
      12.679     0.999829       499425      5851.43
      12.839     0.999854       499438      6826.67
      12.943     0.999878       499450      8192.00
      13.103     0.999890       499457      9102.22
      13.183     0.999902       499462     10240.00
      13.311     0.999915       499468     11702.86
      13.455     0.999927       499474     13653.33
      13.583     0.999939       499480     16384.00
      13.719     0.999945       499483     18204.44
      13.799     0.999951       499486     20480.00
      13.871     0.999957       499489     23405.71
      13.999     0.999963       499492     27306.67
      14.103     0.999969       499495     32768.00
      14.119     0.999973       499497     36408.89
      14.159     0.999976       499498     40960.00
      14.199     0.999979       499500     46811.43
      14.239     0.999982       499501     54613.33
      14.423     0.999985       499503     65536.00
      14.503     0.999986       499504     72817.78
      14.503     0.999988       499504     81920.00
      14.607     0.999989       499505     93622.86
      14.647     0.999991       499506    109226.67
      14.711     0.999992       499507    131072.00
      14.711     0.999993       499507    145635.56
      14.711     0.999994       499507    163840.00
      14.767     0.999995       499508    187245.71
      14.767     0.999995       499508    218453.33
      14.775     0.999996       499509    262144.00
      14.775     0.999997       499509    291271.11
      14.775     0.999997       499509    327680.00
      14.775     0.999997       499509    374491.43
      14.775     0.999998       499509    436906.67
      14.823     0.999998       499510    524288.00
      14.823     1.000000       499510          inf
#[Mean    =        1.088, StdDeviation   =        0.860]
#[Max     =       14.816, Total count    =       499510]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  609453 requests in 1.02m, 1.24GB read
  Socket errors: connect 0, read 0, write 0, timeout 118545
Requests/sec:   9982.85
Transfer/sec:     20.85MB

JSON Output:
{
	"requests": 609453,
	"duration_in_microseconds": 61050013.00,
	"bytes": 1334702070,
	"requests_per_sec": 9982.85,
	"bytes_transfer_per_sec": 21862437.11,
	"latency_distribution": [
		{
			"percentile": 50,
			"latency_in_microseconds": 998
		},
		{
			"percentile": 75,
			"latency_in_microseconds": 1350
		},
		{
			"percentile": 90,
			"latency_in_microseconds": 1675
		},
		{
			"percentile": 99,
			"latency_in_microseconds": 4555
		},
		{
			"percentile": 99.9,
			"latency_in_microseconds": 10583
		},
		{
			"percentile": 99.99,
			"latency_in_microseconds": 13159
		},
		{
			"percentile": 99.999,
			"latency_in_microseconds": 14607
		},
		{
			"percentile": 100,
			"latency_in_microseconds": 14823
		}
	]
}